#+BEGIN_COMMENT
.. title: abbreviations.fish The Abbreviations Configuration
.. slug: abbreviationsfish-the-abbreviations-configuration
.. date: 2023-06-23 13:51:15 UTC-07:00
.. tags: abbreviations,config
.. category: Abbreviations
.. link: 
.. description: The fish abbreviations file.
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2

#+begin_src noweb :tangle ../dingehaufen/abbreviations.fish :exports none
# nikola
<<nikola>>

<<nikola-newpost>>
<<nikola-newpage>>

<<nikola-build>>
<<nikola-deploy>>

# git wit it
<<git>>

<<git-add>>

<<git-commit>>

<<git-remote>>

<<git-branches>>

<<git-differences>>

# pass
<<syncpass>>

# grep
<<grep>>
#+end_src

#+begin_notecard
The abbreviations the file goes into =~/.config/fish/conf.d/=.
#+end_notecard

Abbreviations are sort of like aliases except fish will expand them once you hit space or enter. If, for example, you enter ~nb~ ~ when you hit the space-bar fish will replace ~nb~ with ~nikola bulid~. This makes them more transparent than functions, although they're also less powerful.

According to [[https://github.com/fish-shell/fish-shell/issues/3099][this github issue]] the files you put into ~conf.d/~ get read before ~config.fish~ so whatever you put in there is usable in ~config.fish~ (and using ~config.fish~) at all is optional.

** The State of Things
[[https://fishshell.com/docs/current/cmds/status.html][~status~]] gives you information about the fish-shell. This is the only thing I ever see, though.

#+begin_src fish :results output :exports both
status
#+end_src

#+RESULTS:
: This is not a login shell
: Job control: Only on interactive jobs

But, anyway, I went with ~gstat~ to not block it in case it's really needed at some point.

#+begin_src sh :noweb-ref git-status
abbr --add -- state "git status -sb"
abbr --add -- gstat "git status"
#+end_src

